{
    "projects" : [
        {
            "image" : "images/advisor2.png",
            "title": "Advisor Score",
            "bodyText": "This product provides a frictionless and objective way for clients to understand and visualize how well their financial advisor is performing. Our goal is to equip everyone with the tools they need to make informed financial decisions about their advisor.\n\nOur tool combines industry benchmark statistics with client portfolio performance to deliver the most informed recommendation possible—without a high barrier to entry.",
            "links": [{"href": "https://advisorscorehome.webflow.io/", "text": "Live Website"}
            ],
            "tags" : [
                "AWS",
                "WebFlow",
                "MongoDB",
                "Google Cloud",
                "Python"
            ]
        },
        {
            "image" : "images/nucle.png",
            "title": "Nucleus",
            "bodyText": "The ultimate task management and study tool for students. It allows users to have their course syllabi automatically parsed, with all deadlines and deliverables extracted to make planning easy. Features include course listings, calendar views, and task lists.\n\nGoogle Calendar integration and SMS notification reminders are set up for whitelisted users, along with full integration with the Student Learning Portal (D2L) for grade data.",
            "links": [{"href": "https://youtu.be/tAwsiH81biw", "text": "Full Demo Video"}, {"href": "https://www.linkedin.com/company/teamnucleus/posts/?feedView=all", "text": "LinkedIn"}
            ],
            "tags" : [
                "AWS",
                "Java",
                "React",
                "Apache Maven",
                "MongoDB"
            ]
        },
        {
            "image" : "images/cacowebb.png",
            "title": "Campus Companion",
            "bodyText": "An SMS-based assistant built for on-campus university students to help them navigate common challenges. Designed to assist with everything from accessing mental health resources to booking library rooms.\n\nHosted on AWS using a Lambda function, with Twilio as the SMS provider.",
            "links": [{"href": "https://www.youtube.com/watch?v=qJBBOnINCv8&ab_channel=CacoDev", "text": "SMS Video Demo"},{"href": "https://github.com/dev-caco/webappcaco", "text": "Web App GitHub"}
            ],
            "tags" : [
                "JavaScript",
                "MongoDB",
                "AWS",
                "GCP",
                "Twilio"
            ]
        },
        {
            "image" : "images/sen5.png",
            "title": "Stock Sentiment Analysis Tool",
            "bodyText": "This project was created to provide valuable insight to users about the different stocks available on the market, to help make better investment decisions.\n\nThe UI was developed with React, and the server for pulling stock information was implemented with Flask.\n",
            "links": [{"href": "https://github.com/queens-web-development-club/sentars-site", "text": "GitHub"}
            ],
            "tags" : [
                "React",
                "JavaScript",
                "Flask",
                "Python",
                "HTML",
                "CSS"
            ]
        }
    ]
}